# 1) С помощью функции map выведите список имен с заглавной буквы.
# names = ['alfred', 'tabitha', 'william', 'arla']
# Результат: [‘Alfred’, ‘Tabitha’, ‘William’, ‘Arla’]
# PS. Используйте функцию написанную через def, затем Лямбда-функцию.

# 2) С помощью функции filter выведите список оценок, которые больше 75.
# scores = [66, 90, 68, 59, 76, 60, 88, 74, 81, 65]
# Результат: [90, 76, 88, 81]

# PS. Сначала используйте функцию, объявленную с помощью def, а затем воспользуйтесь Лямбда-функцией.

# 3) С помощью функции filter и Лямбда-функции выведите список слов-палиндромов.
# words = ['Anna', 'Alexey', 'Alla', 'Kazak', 'Dom']
# Результат: [‘Anna’, ‘Alla’, ‘Kazak’]

# 4) Напишите две функции (с генератором и без), которые будут формировать два списка: list1 — это список четных чисел и list2 — это список не четных чисел. Диапазон от 1 до n (n – это число, которое ввел юзер). Затем напишите к ней декоратор, который будет выводить время потраченное на выполнение работы функции, а также размер списка, который она сформировала.

# 5) Есть список слов. Нужно с помощью map и lambda функции вернуть список длин этих слов.
# ('apple', 'banana', 'cherry')
# Результат: [5, 6, 6]

# 6) Есть два текстовых списка. Нужно вернуть один список объединенных слов.
# Подаваемые данные: 2 списка
# ['apple', 'banana', 'cherry'], ['orange', 'lemon', 'pineapple']
# Результат:
# [‘appleorange’, ‘bananalemon’, ‘cherrypineapple’]